[
  {
    "id": 1,
    "name": "Delaware v. Prouse",
    "citation": "440 U.S. 648 (1979)",
    "year": 1979,
    "courtLevel": "supreme",
    "summary": "Random vehicle stops without reasonable suspicion violate Fourth Amendment",
    "facts": [
      "New Castle County police officer stopped Prouse without observing traffic violations",
      "Officer testified he made stop to check license and registration",
      "Officer saw marijuana on floor upon approach",
      "Stop made without any articulable suspicion"
    ],
    "holding": "Law enforcement officers may not stop vehicles without any cause. Stopping an automobile and detaining the driver simply to check license and registration are unreasonable under Fourth Amendment. Distinguished from checkpoint stops.",
    "significance": "Establishes that random vehicle stops require reasonable suspicion",
    "categories": ["traffic-stop", "reasonable-suspicion", "vehicle"],
    "url": ""
  },
  {
    "id": 2,
    "name": "Whren v. United States",
    "citation": "517 U.S. 806 (1996)",
    "year": 1996,
    "courtLevel": "supreme",
    "summary": "Pretextual traffic stops are constitutional if officer has probable cause for traffic violation",
    "facts": [
      "Officers observed vehicle in high drug area",
      "Driver waited unusually long at stop sign",
      "Turned without signaling and sped",
      "Stop led to drug discovery"
    ],
    "holding": "Traffic stop is reasonable if officer has probable cause to believe traffic violation occurred, regardless of officer's subjective motivations. Test is not what reasonable officer would do, but whether valid reasons exist.",
    "significance": "Legalizes pretextual stops - foundational ruling enabling highway interdiction",
    "categories": ["traffic-stop", "pretext", "probable-cause"],
    "url": ""
  },
  {
    "id": 3,
    "name": "Rodriguez v. United States",
    "citation": "575 U.S. 348 (2015)",
    "year": 2015,
    "courtLevel": "supreme",
    "summary": "Traffic stop cannot be prolonged beyond time needed to complete traffic mission without reasonable suspicion",
    "facts": [
      "Officer completed traffic stop tasks",
      "Asked for consent to search",
      "When refused, detained driver for K-9 unit",
      "Dog alerted approximately 7-8 minutes after stop should have ended"
    ],
    "holding": "Police cannot prolong traffic stop beyond time needed to complete traffic-related tasks without reasonable suspicion of additional criminal activity. Authority for seizure ends when tasks tied to traffic infraction are - or reasonably should have been - completed.",
    "significance": "Places strict time limit on traffic stops - mission must tie to traffic violation or independent reasonable suspicion required",
    "categories": ["traffic-stop", "duration", "reasonable-suspicion", "k9"],
    "url": ""
  },
  {
    "id": 4,
    "name": "Heien v. North Carolina",
    "citation": "574 U.S. 54 (2014)",
    "year": 2014,
    "courtLevel": "supreme",
    "summary": "Reasonable mistake of law can provide basis for traffic stop",
    "facts": [
      "Officer stopped vehicle for having one broken brake light",
      "North Carolina law only required one working brake light",
      "Officer was mistaken about law",
      "Stop led to drug discovery"
    ],
    "holding": "Traffic stop based on officer's reasonable mistake of law does not violate Fourth Amendment. Reasonable suspicion can rest on mistaken understanding of governing legal rule.",
    "significance": "Creates 'reasonable mistake of law' doctrine - expands pretext authority even when no actual violation occurred",
    "categories": ["traffic-stop", "mistake-of-law", "pretext"],
    "url": ""
  },
  {
    "id": 5,
    "name": "Kansas v. Glover",
    "citation": "140 S. Ct. 1183 (2020)",
    "year": 2020,
    "courtLevel": "supreme",
    "summary": "Officer may assume registered owner is driving vehicle absent contrary information",
    "facts": [
      "Officer ran license plate",
      "Database showed owner had suspended license",
      "Officer could not see driver",
      "Officer stopped vehicle based on assumption owner was driving"
    ],
    "holding": "It is reasonable to infer that registered owner is driving vehicle, providing reasonable suspicion for stop when owner has suspended license. Commonsense inference combining database information and judgment.",
    "significance": "Authorizes stops based on registered owner status without visual confirmation of driver identity",
    "categories": ["traffic-stop", "reasonable-suspicion", "license"],
    "url": ""
  },
  {
    "id": 6,
    "name": "Navarrette v. California",
    "citation": "572 U.S. 393 (2014)",
    "year": 2014,
    "courtLevel": "supreme",
    "summary": "Anonymous 911 call can provide reasonable suspicion for traffic stop",
    "facts": [
      "911 caller reported truck ran them off road",
      "Caller provided license plate",
      "Officer stopped truck approximately 20 minutes later",
      "Officers smelled marijuana and found 40 pounds"
    ],
    "holding": "Under totality of circumstances, officer had reasonable suspicion that driver was intoxicated based on anonymous 911 tip bearing sufficient indicia of reliability.",
    "significance": "Anonymous tips can establish reasonable suspicion when they bear sufficient indicia of reliability",
    "categories": ["traffic-stop", "reasonable-suspicion", "anonymous-tip"],
    "url": ""
  },
  {
    "id": 7,
    "name": "Michigan Dept. of State Police v. Sitz",
    "citation": "496 U.S. 444 (1990)",
    "year": 1990,
    "courtLevel": "supreme",
    "summary": "DUI checkpoints are constitutional",
    "facts": [
      "Michigan State Police established sobriety checkpoint",
      "All vehicles stopped briefly",
      "Average delay 25 seconds",
      "126 vehicles in 75 minutes, 1 arrest"
    ],
    "holding": "Stops during DUI checkpoint are reasonable seizures given limited intrusion and state interest in curbing drunk driving. Checkpoint balances individual rights against state need.",
    "significance": "Establishes constitutionality of suspicionless stops at checkpoints for specific public safety purposes",
    "categories": ["checkpoint", "dui", "administrative-search"],
    "url": ""
  },
  {
    "id": 8,
    "name": "City of Indianapolis v. Edmond",
    "citation": "531 U.S. 32 (2000)",
    "year": 2000,
    "courtLevel": "supreme",
    "summary": "Checkpoints for general drug interdiction violate Fourth Amendment",
    "facts": [
      "Indianapolis police set up narcotics checkpoints",
      "Primary purpose was drug detection",
      "Brief stops to check license and look for drug evidence"
    ],
    "holding": "Roadblocks set up expressly for narcotics interdiction violate Fourth Amendment. Checkpoints require specific public safety purpose, not general crime detection. Removes individualized suspicion requirement.",
    "significance": "Limits checkpoint authority - cannot be used for general criminal investigation",
    "categories": ["checkpoint", "narcotics", "administrative-search"],
    "url": ""
  },
  {
    "id": 9,
    "name": "Arizona v. Gant",
    "citation": "556 U.S. 332 (2009)",
    "year": 2009,
    "courtLevel": "supreme",
    "summary": "Search incident to arrest of vehicle limited to reachable areas or evidence of crime of arrest",
    "facts": [
      "Gant arrested for driving on suspended license",
      "Handcuffed and secured in patrol car",
      "Officers searched vehicle, found cocaine",
      "Gant could not access vehicle at time of search"
    ],
    "holding": "Vehicle search incident to arrest permitted only when arrestee is within reaching distance OR when reasonable to believe vehicle contains evidence of offense of arrest. Neither possibility existed here.",
    "significance": "Significantly restricts Belton rule for vehicle searches - mere fact of arrest no longer sufficient",
    "categories": ["vehicle-search", "search-incident-to-arrest"],
    "url": ""
  },
  {
    "id": 10,
    "name": "California v. Carney",
    "citation": "471 U.S. 386 (1985)",
    "year": 1985,
    "courtLevel": "supreme",
    "summary": "Motor home treated as vehicle when used on highways or capable of highway use",
    "facts": [
      "DEA agents surveilled motor home",
      "Observed youth enter and leave",
      "Youth stated he had sex in exchange for marijuana",
      "Agents entered motor home without warrant"
    ],
    "holding": "Warrant not required when vehicle is being used on highways or capable of such use and found stationary in place not regularly used for residential purposes. Objective observer would conclude vehicle was being used as vehicle, not residence.",
    "significance": "Automobile exception extends to mobile homes in certain circumstances",
    "categories": ["vehicle-search", "automobile-exception", "motor-home"],
    "url": ""
  },
  {
    "id": 11,
    "name": "Illinois v. Caballes",
    "citation": "543 U.S. 405 (2005)",
    "year": 2005,
    "courtLevel": "supreme",
    "summary": "K-9 sniff during lawful traffic stop is not a search",
    "facts": [
      "Traffic stop for speeding",
      "K-9 unit arrived while stop was ongoing",
      "Dog alerted to trunk",
      "Search revealed marijuana"
    ],
    "holding": "Exterior dog sniff of vehicle is not a search under Fourth Amendment because it only reveals contraband, in which there is no legitimate privacy expectation. Permissible during lawful stop.",
    "significance": "Legitimizes K-9 as interdiction tool during lawful traffic stops",
    "categories": ["vehicle-search", "k9", "plain-smell"],
    "url": ""
  },
  {
    "id": 12,
    "name": "Ohio v. Robinette",
    "citation": "519 U.S. 33 (1996)",
    "year": 1996,
    "courtLevel": "supreme",
    "summary": "Officer not required to inform motorist they are free to go before requesting consent",
    "facts": [
      "Deputy stopped driver for speeding",
      "Issued verbal warning",
      "Asked if driver had drugs or weapons",
      "Requested consent to search",
      "Search revealed drugs"
    ],
    "holding": "Fourth Amendment does not require officers to inform motorists that they are free to go before seeking consent to search. Voluntariness determined by totality of circumstances.",
    "significance": "Preserves legal ambiguity of post-stop encounter - enables coercive 'consent'",
    "categories": ["consent", "traffic-stop", "voluntary-encounter"],
    "url": ""
  },
  {
    "id": 13,
    "name": "United States v. Drayton",
    "citation": "536 U.S. 194 (2002)",
    "year": 2002,
    "courtLevel": "supreme",
    "summary": "Officers not required to advise of right to refuse consent",
    "facts": [
      "Officers boarded bus",
      "Asked passengers for consent to search bags and persons",
      "No advisement of right to refuse"
    ],
    "holding": "Voluntariness of consent determined by totality of circumstances. Officers need not advise citizens of right to refuse consent.",
    "significance": "Reinforces that consent need not be informed - increases coercive potential",
    "categories": ["consent", "voluntary-encounter"],
    "url": ""
  },
  {
    "id": 14,
    "name": "Brendlin v. California",
    "citation": "551 U.S. 249 (2007)",
    "year": 2007,
    "courtLevel": "supreme",
    "summary": "Passenger is seized during traffic stop",
    "facts": [
      "Officer stopped vehicle for expired registration",
      "Passenger had outstanding warrant",
      "Passenger challenged standing to contest stop"
    ],
    "holding": "Passenger in vehicle is seized within meaning of Fourth Amendment during traffic stop and has standing to challenge stop's constitutionality. Reasonable person in passenger's position would not feel free to leave.",
    "significance": "Extends Fourth Amendment protection to passengers during traffic stops",
    "categories": ["traffic-stop", "passenger", "standing"],
    "url": ""
  },
  {
    "id": 15,
    "name": "Utah v. Strieff",
    "citation": "579 U.S. 232 (2016)",
    "year": 2016,
    "courtLevel": "supreme",
    "summary": "Attenuation doctrine allows evidence despite unlawful stop if valid warrant discovered",
    "facts": [
      "Officer unlawfully detained Strieff",
      "Ran warrant check",
      "Discovered outstanding warrant",
      "Arrested and searched incident to warrant",
      "Found drugs"
    ],
    "holding": "Discovery of valid arrest warrant attenuates connection between unlawful stop and evidence, allowing admission under attenuation doctrine. Applied Brown v. Illinois factors: temporal proximity, intervening circumstances, purpose/flagrancy.",
    "significance": "Creates get-out-of-jail-free card for Rodriguez violations - unlawful detention cured by warrant discovery",
    "categories": ["exclusionary-rule", "attenuation", "warrant"],
    "url": ""
  },
  {
    "id": 16,
    "name": "Lange v. California",
    "citation": "594 U.S. 295 (2021)",
    "year": 2021,
    "courtLevel": "supreme",
    "summary": "Pursuit of fleeing misdemeanant does not always justify warrantless home entry",
    "facts": [
      "Officer began pursuing Lange for noise infraction",
      "Lange drove into garage",
      "Officer followed into garage without warrant",
      "Discovered DUI"
    ],
    "holding": "Pursuit of misdemeanor suspect does not categorically justify warrantless home entry. Requires case-by-case assessment of exigency. When totality shows emergency (imminent harm, threat to officer, evidence destruction, escape), entry permitted.",
    "significance": "Limits hot pursuit exception for minor offenses - protects sanctity of home",
    "categories": ["warrant", "hot-pursuit", "exigent-circumstances", "home"],
    "url": ""
  },
  {
    "id": 17,
    "name": "Warden v. Hayden",
    "citation": "387 U.S. 294 (1967)",
    "year": 1967,
    "courtLevel": "supreme",
    "summary": "Hot pursuit of fleeing felon justifies warrantless home entry",
    "facts": [
      "Armed robbery suspect fled into house",
      "Police entered within 5 minutes",
      "Searched for suspect and weapons"
    ],
    "holding": "When police informed that armed robbery occurred and suspect entered house less than 5 minutes earlier, warrantless entry reasonable. Officers acted reasonably. Speed essential when suspect at large. Permissible scope as broad as reasonably necessary to prevent danger.",
    "significance": "Establishes hot pursuit exception for exigent circumstances",
    "categories": ["warrant", "hot-pursuit", "exigent-circumstances"],
    "url": ""
  },
  {
    "id": 18,
    "name": "Terry v. Ohio",
    "citation": "392 U.S. 1 (1968)",
    "year": 1968,
    "courtLevel": "supreme",
    "summary": "Officer may stop and frisk based on reasonable suspicion",
    "facts": [
      "Officer observed suspicious behavior",
      "Believed men were casing store for robbery",
      "Stopped and patted down suspects",
      "Found concealed weapons"
    ],
    "holding": "When officer has reasonable suspicion that individual is armed and dangerous, officer may conduct brief stop and protective frisk. Purpose is protective, not investigative.",
    "significance": "Creates Terry stop doctrine - foundational reasonable suspicion standard",
    "categories": ["terry-stop", "reasonable-suspicion", "frisk"],
    "url": ""
  },
  {
    "id": 19,
    "name": "Barnes v. Felix",
    "citation": "144 S. Ct. 725 (2025)",
    "year": 2025,
    "courtLevel": "supreme",
    "summary": "Excessive force must be evaluated based on totality of circumstances, not isolated moment",
    "facts": [
      "Stop for outstanding toll violations",
      "Escalated to use of force",
      "Circuit split on moment-of-threat vs totality approach"
    ],
    "holding": "Excessive force claims must be evaluated based on totality of circumstances of the seizure, not just isolated moment of danger. Rejects Fifth Circuit's 'moment of threat' approach.",
    "significance": "Resolves circuit split on excessive force analysis in traffic stop context",
    "categories": ["excessive-force", "traffic-stop", "fourth-amendment"],
    "url": ""
  },
  {
    "id": 20,
    "name": "Pennsylvania v. Mimms",
    "citation": "434 U.S. 106 (1977)",
    "year": 1977,
    "courtLevel": "supreme",
    "summary": "Officers may order driver out of lawfully stopped vehicle",
    "facts": [
      "Officers stopped vehicle for expired license plate",
      "Officer asked Mimms to step out",
      "Officer noticed large bulge under jacket",
      "Frisk revealed loaded revolver"
    ],
    "holding": "Ordering driver out of lawfully stopped car is reasonable and permissible under Fourth Amendment. Additional intrusion is minimal and de minimis to safety of officers.",
    "significance": "Automatic authority to order driver from vehicle during traffic stop",
    "categories": ["traffic-stop", "officer-safety"],
    "url": ""
  },
  {
    "id": 21,
    "name": "Maryland v. Wilson",
    "citation": "519 U.S. 408 (1997)",
    "year": 1997,
    "courtLevel": "supreme",
    "summary": "Officers may order passengers out of lawfully stopped vehicle",
    "facts": [
      "Officer pursued vehicle for speeding",
      "Noticed two passengers ducking in and out of sight",
      "Officer ordered passenger Wilson from car",
      "Cocaine fell to ground"
    ],
    "holding": "On a traffic stop, it is reasonable to order or remove a passenger from the vehicle. While no same basis for ordering passenger out as driver, additional intrusion on passenger is minimal.",
    "significance": "Extends Mimms to passengers - officers may order all occupants from vehicle",
    "categories": ["traffic-stop", "passenger", "officer-safety"],
    "url": ""
  },
  {
    "id": 22,
    "name": "Maryland v. Pringle",
    "citation": "540 U.S. 366 (2003)",
    "year": 2003,
    "courtLevel": "supreme",
    "summary": "Officers may arrest all occupants for constructive possession of drugs in vehicle",
    "facts": [
      "Officer stopped vehicle for speeding",
      "Found $763 in glove compartment",
      "Found five baggies of cocaine in back seat armrest",
      "Cocaine accessible to all three occupants",
      "None admitted ownership"
    ],
    "holding": "Entirely reasonable inference that any or all three occupants had knowledge of and exercised dominion over cocaine. Reasonable officer could conclude probable cause existed to believe Pringle committed possession, solely or jointly.",
    "significance": "Probable cause can exist for all occupants when contraband accessible to all - 33% chance sufficient",
    "categories": ["probable-cause", "constructive-possession", "vehicle"],
    "url": ""
  },
  {
    "id": 23,
    "name": "Byrd v. United States",
    "citation": "584 U.S. 395 (2018)",
    "year": 2018,
    "courtLevel": "supreme",
    "summary": "Unauthorized driver in rental vehicle may have expectation of privacy",
    "facts": [
      "Byrd driving rental car not in his name",
      "Straw renter gave keys to Byrd immediately",
      "State police made traffic stop",
      "Officers searched without consent, claiming no expectation of privacy",
      "Found 49 bricks of heroin and body armor"
    ],
    "holding": "Unauthorized driver in rental vehicle may still have expectation of privacy in that vehicle. Remanded to determine if warrant exception applied.",
    "significance": "Being unauthorized driver does not automatically eliminate Fourth Amendment protection",
    "categories": ["vehicle", "expectation-of-privacy", "standing"],
    "url": ""
  },
  {
    "id": 24,
    "name": "Carroll v. United States",
    "citation": "267 U.S. 132 (1925)",
    "year": 1925,
    "courtLevel": "supreme",
    "summary": "Automobile exception allows warrantless search with probable cause",
    "facts": [
      "Prohibition agents met with Carroll to buy illegal whiskey",
      "Later saw Carroll driving, suspected contraband",
      "Searched vehicle, found whiskey"
    ],
    "holding": "Warrantless search of automobile permitted when officer has probable cause to believe it contains contraband. Based on vehicle mobility and reduced expectation of privacy.",
    "significance": "Foundational case establishing automobile exception to warrant requirement",
    "categories": ["vehicle-search", "automobile-exception", "probable-cause"],
    "url": ""
  },
  {
    "id": 25,
    "name": "Maryland v. Dyson",
    "citation": "527 U.S. 465 (1999)",
    "year": 1999,
    "courtLevel": "supreme",
    "summary": "Automobile exception requires no separate exigency beyond probable cause",
    "facts": [
      "Reliable informant tipped that Dyson went to NY to buy drugs",
      "Would return that night in rental car",
      "Deputies stopped car, searched without warrant",
      "Found crack cocaine in duffel bag in trunk"
    ],
    "holding": "Automobile exception has no separate exigency requirement. If car is readily mobile and probable cause exists to believe it contains contraband, warrant not needed.",
    "significance": "Clarifies automobile exception does not require showing of specific exigency",
    "categories": ["vehicle-search", "automobile-exception"],
    "url": ""
  },
  {
    "id": 26,
    "name": "United States v. Ross",
    "citation": "456 U.S. 798 (1982)",
    "year": 1982,
    "courtLevel": "supreme",
    "summary": "Automobile exception extends to containers within vehicle",
    "facts": [
      "Officers stopped car based on tip about drug sale",
      "Opened trunk, found closed paper bag",
      "Inside discovered plastic packages of heroin",
      "Later drove car to headquarters and searched again"
    ],
    "holding": "Officer may search entire vehicle including containers (bags, boxes, suitcases) within vehicle, provided search limited to areas and containers that could physically contain seizable item officer has probable cause to believe is in vehicle.",
    "significance": "Automobile exception extends to all containers that could conceal object of search",
    "categories": ["vehicle-search", "automobile-exception", "containers"],
    "url": ""
  },
  {
    "id": 27,
    "name": "New York v. Belton",
    "citation": "453 U.S. 454 (1981)",
    "year": 1981,
    "courtLevel": "supreme",
    "summary": "Search incident to arrest may include passenger compartment and containers within",
    "facts": [
      "Vehicle stopped for speeding",
      "Officer smelled burned marijuana",
      "Arrested all occupants for possession",
      "Searched passenger compartment",
      "Found cocaine in Belton's jacket pocket"
    ],
    "holding": "When police make lawful custodial arrest of vehicle occupant, may as contemporaneous incident search passenger compartment of automobile and contents of any containers found within passenger compartment.",
    "significance": "Bright-line rule for vehicle searches incident to arrest - later limited by Gant",
    "categories": ["vehicle-search", "search-incident-to-arrest"],
    "url": ""
  },
  {
    "id": 28,
    "name": "Chimel v. California",
    "citation": "395 U.S. 752 (1969)",
    "year": 1969,
    "courtLevel": "supreme",
    "summary": "Search incident to arrest limited to area within immediate control",
    "facts": [
      "Officers arrested Chimel at home with warrant",
      "Searched entire house without search warrant",
      "Claimed search incident to arrest"
    ],
    "holding": "Search incident to arrest limited to arrestee's person and area within immediate control - places from which arrestee might obtain weapon or destroy evidence. Warrantless searches are exception, not rule.",
    "significance": "Foundational case limiting scope of search incident to arrest",
    "categories": ["search-incident-to-arrest", "warrant"],
    "url": ""
  },
  {
    "id": 29,
    "name": "Arizona v. Hicks",
    "citation": "480 U.S. 321 (1987)",
    "year": 1987,
    "courtLevel": "supreme",
    "summary": "Plain view requires probable cause, not just reasonable suspicion",
    "facts": [
      "Officers responded to shooting",
      "Saw expensive stereo equipment",
      "Moved equipment to get serial numbers",
      "Discovered stolen property"
    ],
    "holding": "Moving equipment to view serial numbers was search requiring probable cause. Plain view requires incriminating nature be immediately apparent - probable cause, not reasonable suspicion. No lesser standard for seizure during unrelated search.",
    "significance": "Establishes that plain view doctrine requires full probable cause",
    "categories": ["plain-view", "probable-cause"],
    "url": ""
  },
  {
    "id": 30,
    "name": "Illinois v. Gates",
    "citation": "462 U.S. 213 (1983)",
    "year": 1983,
    "courtLevel": "supreme",
    "summary": "Probable cause determined under totality of circumstances",
    "facts": [
      "Anonymous letter detailed drug operation",
      "Police corroborated some details",
      "Obtained warrant based on totality"
    ],
    "holding": "Probable cause exists when, under totality of circumstances, there is fair probability that contraband or evidence will be found in place to be searched. Magistrate makes practical, common-sense decision.",
    "significance": "Establishes totality of circumstances test, replacing Aguilar-Spinelli two-prong test",
    "categories": ["warrant", "probable-cause", "totality-of-circumstances"],
    "url": ""
  },
  {
    "id": 31,
    "name": "Caniglia v. Strom",
    "citation": "593 U.S. 194 (2021)",
    "year": 2021,
    "courtLevel": "supreme",
    "summary": "Community caretaking exception does not justify warrantless home searches",
    "facts": [
      "Officers responded to welfare check",
      "Entered home without warrant",
      "Seized person and firearms",
      "Claimed community caretaking function"
    ],
    "holding": "Community caretaking duties do not create standalone doctrine justifying warrantless searches and seizures in the home. Cady v. Dombrowski's vehicle caretaking rationale does not extend to homes.",
    "significance": "Limits community caretaking exception - does not apply to homes like it does to vehicles",
    "categories": ["warrant", "community-caretaking", "home"],
    "url": ""
  },
  {
    "id": 32,
    "name": "Brigham City v. Stuart",
    "citation": "547 U.S. 398 (2006)",
    "year": 2006,
    "courtLevel": "supreme",
    "summary": "Emergency aid exception allows entry to prevent harm",
    "facts": [
      "Officers responded to loud party",
      "Saw fight through window",
      "Entered to prevent bodily harm",
      "Made arrests"
    ],
    "holding": "Need to protect or preserve life or avoid serious injury justifies otherwise illegal warrantless entry, regardless of officer's subjective intent. Action reasonable under Fourth Amendment based on objective circumstances.",
    "significance": "Establishes emergency aid exception based on objective circumstances, not officer motive",
    "categories": ["warrant", "exigent-circumstances", "emergency-aid"],
    "url": ""
  },
  {
    "id": 33,
    "name": "Floyd v. City of New York",
    "citation": "813 F. Supp. 2d 417 (S.D.N.Y. 2011)",
    "year": 2011,
    "courtLevel": "district",
    "summary": "Stop and frisk policies targeting Black and Hispanic individuals violate Fourth Amendment",
    "facts": [
      "NYPD stop and frisk practices challenged",
      "Statistical evidence of racial targeting",
      "Black and Hispanic individuals stopped at disproportionate rates",
      "Lower hit rates for contraband than white individuals"
    ],
    "holding": "Stop and frisk policies that result in increased stops and frisks for Black and Hispanic individuals are violation of Fourth Amendment.",
    "significance": "Landmark decision finding racial profiling in Terry stops violates Constitution",
    "categories": ["terry-stop", "racial-profiling", "civil-rights"],
    "url": ""
  },
  {
    "id": 34,
    "name": "King v. Commonwealth",
    "citation": "302 S.W.3d 649 (Ky. 2010)",
    "year": 2010,
    "courtLevel": "kentucky-supreme",
    "summary": "Police cannot create exigent circumstances they rely upon to justify warrantless entry",
    "facts": [
      "Police knocked on door",
      "Heard sounds of movement inside",
      "Made warrantless entry claiming evidence destruction",
      "Later affirmed after Supreme Court reversal"
    ],
    "holding": "Police cannot create exigent circumstances to avoid warrant requirement. Two-part test: (1) Did police deliberately create exigency with bad faith to avoid warrant? (2) Even absent bad faith, was it foreseeable that tactics would create exigency? No exigency created simply because probable cause exists.",
    "significance": "Kentucky establishes stricter standard than federal law on manufactured exigencies",
    "categories": ["warrant", "exigent-circumstances", "kentucky"],
    "url": ""
  },
  {
    "id": 35,
    "name": "Posey v. Commonwealth",
    "citation": "185 S.W.3d 170 (Ky. 2006)",
    "year": 2006,
    "courtLevel": "kentucky-supreme",
    "summary": "Exigent circumstances exist when officers have probable cause and evidence in imminent danger",
    "facts": [
      "Officers saw marijuana in plain view",
      "Believed evidence in imminent danger of destruction",
      "Made warrantless entry"
    ],
    "holding": "Where officers have probable cause that crime occurred and evidence in imminent danger of destruction, warrantless entry reasonable to secure evidence. Applies even to misdemeanor crimes if jailable offense.",
    "significance": "Imminent destruction of evidence can justify warrantless entry even for misdemeanor drug offenses",
    "categories": ["warrant", "exigent-circumstances", "kentucky", "evidence-destruction"],
    "url": ""
  },
  {
    "id": 36,
    "name": "Bishop v. Commonwealth",
    "citation": "237 S.W.3d 567 (Ky. 2007)",
    "year": 2007,
    "courtLevel": "kentucky-supreme",
    "summary": "Plain smell of chemicals can create exigent circumstances for public safety",
    "facts": [
      "Officers investigating stolen plate",
      "Car trunk open 3-5 inches",
      "Strong chemical smell of meth production",
      "Opened trunk, discovered active meth labs"
    ],
    "holding": "Chemical smell authorized seizure based on legitimate public safety concern when methamphetamine being produced. Officers had legitimate concern for public safety.",
    "significance": "Plain smell can create exigent circumstances based on public safety, not just evidence destruction",
    "categories": ["plain-smell", "exigent-circumstances", "kentucky", "public-safety"],
    "url": ""
  },
  {
    "id": 37,
    "name": "Commonwealth v. Pride",
    "citation": "203 S.W.3d 43 (Ky. 2010)",
    "year": 2010,
    "courtLevel": "kentucky-supreme",
    "summary": "Probable cause assessed under totality of circumstances",
    "facts": [
      "Warrant affidavit contained multiple pieces of information",
      "Each piece individually inadequate",
      "Collectively established probable cause"
    ],
    "holding": "Although each element in affidavit individually inadequate for probable cause, collective information under totality of circumstances can establish probable cause. Substantial basis for conclusion that probable cause existed.",
    "significance": "Kentucky follows Illinois v. Gates totality of circumstances test for probable cause",
    "categories": ["warrant", "probable-cause", "kentucky"],
    "url": ""
  },
  {
    "id": 38,
    "name": "Guth v. Commonwealth",
    "citation": "29 S.W.3d 809 (Ky. App. 2000)",
    "year": 2000,
    "courtLevel": "kentucky-appeals",
    "summary": "Warrant must establish probable cause that evidence will be found at place to be searched",
    "facts": [
      "Affidavit stated officer observed drug transaction",
      "Transaction occurred in motel parking lot",
      "Warrant sought for defendant's mobile home miles away",
      "No connection between crime location and search location"
    ],
    "holding": "Even though officer saw drug transaction, no probable cause that evidence would be at mobile home. Warrant must establish nexus between crime and place to be searched.",
    "significance": "Probable cause requires two elements: (1) crime occurred, (2) evidence of that crime at location to be searched",
    "categories": ["warrant", "probable-cause", "kentucky", "particularity"],
    "url": ""
  },
  {
    "id": 39,
    "name": "Cook v. Commonwealth",
    "citation": "826 S.W.2d 329 (Ky. 1992)",
    "year": 1992,
    "courtLevel": "kentucky-supreme",
    "summary": "Consent must be freely and voluntarily given under totality of circumstances",
    "facts": [
      "Warrantless search challenged",
      "Commonwealth claimed consent",
      "Trial court applied wrong standard requiring intelligent consent"
    ],
    "holding": "For warrantless searches, Commonwealth bears burden to prove consent was freely and voluntarily given under all circumstances. Different standard than Fifth Amendment 'knowing and intelligent' waiver. Warrantless searches presumed unreasonable.",
    "significance": "Establishes Kentucky standard for consent searches - voluntary, not necessarily intelligent",
    "categories": ["consent", "kentucky", "fourth-amendment"],
    "url": ""
  },
  {
    "id": 40,
    "name": "Milam v. Commonwealth",
    "citation": "483 S.W.3d 347 (Ky. 2015)",
    "year": 2015,
    "courtLevel": "kentucky-supreme",
    "summary": "Third-party consent given after unlawful entry cannot cure initial violation",
    "facts": [
      "Police unlawfully entered fraternity house",
      "After entry, obtained consent from third party",
      "Claimed consent validated search"
    ],
    "holding": "Third-party consent given after police unlawfully entered cannot cure the initial impermissible entry into home.",
    "significance": "Unlawful entry taints subsequent consent, even from third parties with authority",
    "categories": ["consent", "kentucky", "tainted-consent", "third-party"],
    "url": ""
  },
  {
    "id": 41,
    "name": "Frazier v. Commonwealth",
    "citation": "406 S.W.3d 448 (Ky. 2013)",
    "year": 2013,
    "courtLevel": "kentucky-supreme",
    "summary": "Terry frisk must be protective, not investigative, with reasonable suspicion of weapons",
    "facts": [
      "Officer conducted Terry frisk",
      "Search exceeded protective purpose",
      "Became investigative search"
    ],
    "holding": "Purpose of Terry frisk is protective, not investigative. Reasonable suspicion must logically relate to frisk's protective objective. If exceeds protective scope, evidence suppressed.",
    "significance": "Kentucky enforces strict limits on Terry frisks - must have reasonable suspicion specifically of weapons",
    "categories": ["terry-stop", "frisk", "kentucky", "reasonable-suspicion"],
    "url": ""
  },
  {
    "id": 42,
    "name": "Dunn v. Commonwealth",
    "citation": "199 S.W.3d 775 (Ky. App. 2006)",
    "year": 2006,
    "courtLevel": "kentucky-appeals",
    "summary": "Marijuana smell provides probable cause to search vehicle and occupants",
    "facts": [
      "Traffic stop",
      "Officer smelled marijuana",
      "Searched vehicle and persons"
    ],
    "holding": "Marijuana smell provides probable cause to search not only vehicle but also people subject to traffic stop.",
    "significance": "Plain smell doctrine in Kentucky extends to search of persons, not just vehicle",
    "categories": ["plain-smell", "kentucky", "vehicle-search", "probable-cause"],
    "url": ""
  },
  {
    "id": 43,
    "name": "United States v. Chambers",
    "citation": "395 F.3d 563 (6th Cir. 2005)",
    "year": 2005,
    "courtLevel": "sixth-circuit",
    "summary": "Consent after illegal entry is invalid unless taint dissipated",
    "facts": [
      "Police made illegal entry",
      "Individual consented to search after entry",
      "Government claimed consent validated search"
    ],
    "holding": "When individual consents to search after illegal entry, consent not valid and suppression required of items seized, unless taint from initial entry dissipated before consent given.",
    "significance": "Illegal entry taints subsequent consent - burden on government to show attenuation",
    "categories": ["consent", "sixth-circuit", "tainted-consent", "exclusionary-rule"],
    "url": ""
  },
  {
    "id": 44,
    "name": "United States v. Beauchamp",
    "citation": "659 F.3d 560 (6th Cir. 2011)",
    "year": 2011,
    "courtLevel": "sixth-circuit",
    "summary": "Prolonged or illegal detention can taint consent",
    "facts": [
      "Prolonged detention beyond traffic stop",
      "Consent obtained during unlawful detention",
      "Challenged as involuntary"
    ],
    "holding": "Prolonged or otherwise illegal detention can taint any consent given, rendering it involuntary.",
    "significance": "Extends Rodriguez principles - unlawfully prolonged detention taints consent",
    "categories": ["consent", "sixth-circuit", "prolonged-detention", "rodriguez"],
    "url": ""
  },
  {
    "id": 45,
    "name": "United States v. Bates",
    "citation": "84 F.3d 790 (6th Cir. 1996)",
    "year": 1996,
    "courtLevel": "sixth-circuit",
    "summary": "Hot pursuit to prevent escape can justify warrantless entry",
    "facts": [
      "Suspect fleeing",
      "Officers in hot pursuit",
      "Entered residence without warrant"
    ],
    "holding": "Exigent circumstances include escape of suspect, justifying warrantless entry during hot pursuit.",
    "significance": "Establishes hot pursuit exception in 6th Circuit",
    "categories": ["warrant", "sixth-circuit", "hot-pursuit", "exigent-circumstances"],
    "url": ""
  },
  {
    "id": 46,
    "name": "United States v. Morgan",
    "citation": "743 F.2d 1158 (6th Cir. 1984)",
    "year": 1984,
    "courtLevel": "sixth-circuit",
    "summary": "Police not free to create exigent circumstances",
    "facts": [
      "Police conduct created exigent circumstances",
      "Used created circumstances to justify warrantless intrusion"
    ],
    "holding": "Police officials are not free to create exigent circumstances to justify their warrantless intrusions.",
    "significance": "Early 6th Circuit precedent prohibiting manufactured exigencies",
    "categories": ["warrant", "sixth-circuit", "exigent-circumstances", "manufactured-exigency"],
    "url": ""
  },
  {
    "id": 47,
    "name": "United States v. Williams",
    "citation": "354 F.3d 497 (6th Cir. 2003)",
    "year": 2003,
    "courtLevel": "sixth-circuit",
    "summary": "Police cannot create exigent circumstances even with probable cause",
    "facts": [
      "Police had probable cause",
      "Created exigent circumstances through their actions",
      "Claimed exigency justified warrantless entry"
    ],
    "holding": "Police cannot create exigent circumstances even when they possess probable cause that a crime has been committed.",
    "significance": "Reinforces Morgan - manufactured exigency invalid regardless of probable cause",
    "categories": ["warrant", "sixth-circuit", "exigent-circumstances", "manufactured-exigency"],
    "url": ""
  },
  {
    "id": 48,
    "name": "Goodwin v. City of Painesville",
    "citation": "781 F.3d 314 (6th Cir. 2015)",
    "year": 2015,
    "courtLevel": "sixth-circuit",
    "summary": "Commonwealth bears heavy burden to justify warrantless search",
    "facts": [
      "Warrantless search challenged",
      "Commonwealth claimed exception to warrant requirement"
    ],
    "holding": "Burden of proof upon Commonwealth to justify warrantless search has been described as a 'heavy' burden.",
    "significance": "Emphasizes strict scrutiny applied to warrantless searches in 6th Circuit",
    "categories": ["warrant", "sixth-circuit", "burden-of-proof"],
    "url": ""
  },
  {
    "id": 49,
    "name": "Roy Stucker v. Louisville Metro Gov't",
    "citation": "No. 22-5411 (6th Cir. 2024)",
    "year": 2024,
    "courtLevel": "sixth-circuit",
    "summary": "Wrong-house raid based on stale, unverified information violated Fourth Amendment",
    "facts": [
      "LMPD obtained warrant for vacant house",
      "Suspect had been jailed days earlier",
      "Officers broke in military fashion and detained innocent painter, girlfriend, and child",
      "Warrant based on stale, unverified information",
      "Officer who secured warrant had no formal training on warrants for 6+ years"
    ],
    "holding": "No probable cause existed for warrant. Warrant based on stale, unverified information violates Fourth Amendment. District court erred in finding no constitutional violation. LMPD has history of improper searches.",
    "significance": "Post-Breonna Taylor case highlighting LMPD's systemic warrant problems and holding officers liable for wrong-house raids. Cites DOJ pattern-or-practice investigation.",
    "categories": ["warrant", "sixth-circuit", "wrong-house", "stale-information", "lmpd"],
    "url": ""
  }
]
